# Semana 2 do Aceleradev DS Codenation

### Professor: Túlio Vieira de Souza  |  Tema: Manipulação de Dados e Análise Descritiva

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

como pedir __ajuda__ para descobrir o que os métodos fazem?
```python
pacote?
pacote.método?
```

In [2]:
pd.read_csv?

Para ilustrar o funcionamento do pacote __Pandas__, e até para nos acostumarmos à manipulação de dados, é necessário aprender mexer com __DICIONÁRIOS__

In [3]:
dados = {
    'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
    'acessos': [100, 200, 300, 400, 400],
    'site': ['site1', 'site2', 'site3', 'site4', np.nan],
    'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

Diferente da maioria das IDEs, o notebook retorna os valores de uma variável rodando ela simplesmente, sem precisar  da função print()

In [4]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 400],
 'site': ['site1', 'site2', 'site3', 'site4', nan],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

Um dicionário tem a seguinte __estrutura__:

* *.keys()*: são os __Títulos__ das colunas. No nosso dicionário são canal_vendas, acessos, site, vendas
* *.values()*: são os __Valores__ que as colunas carregam. No nosso dicionário são as listas
* *.items()*: são os __CONJUNTOS__ de _keys_ e _values_. No nosso exemplo, 'acessos':[100, 200, 300, 400, 500] é um item

In [5]:
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [6]:
dados.values()  # este retorna uma LISTA de LISTAS

dict_values([['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'], [100, 200, 300, 400, 400], ['site1', 'site2', 'site3', 'site4', nan], [1000.52, 1052.34, 2002, 5000, 300]])

In [7]:
dados.items()  # este retorna uma LISTA de TUPLAS

dict_items([('canal_venda', ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']), ('acessos', [100, 200, 300, 400, 400]), ('site', ['site1', 'site2', 'site3', 'site4', nan]), ('vendas', [1000.52, 1052.34, 2002, 5000, 300])])

Podemos verificar o tipo de uma variável com o comando
```python
type(variável)
```

In [8]:
type(dados)

dict

In [9]:
type(dados['acessos'])

list

In [10]:
type(dados.items())

dict_items

Quando temos colunas que seus _.values()_ são listas, podemos usar as propriedades de __slicing__
* [n]
* [:n]
* [n:]
* [-n]

In [11]:
dados['acessos'][0]

100

In [12]:
dados['acessos'][1:3]

[200, 300]

In [13]:
dados['acessos'][-1]

400

In [14]:
dados['acessos'][:3]

[100, 200, 300]

Também é importante saber manipular __LISTAS__, pois várias das _.keys()_ dos dicionários estão nesse formato. Uma lista nada mais é que uma variável composta que possui seus valores dentro de [ ] e são indexados
```python
[1, 'a', 3.5, 6, ...]
```

In [15]:
[1, 3, 'a', 4.5]

[1, 3, 'a', 4.5]

In [16]:
type([1, 2, 3])

list

Para adicionar novos conjuntos de valores a um dicionário
```python
dicionario['nova key'] = valor
```

In [17]:
dados['lista'] = [1, 2, 3, 4, 'a']

In [18]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 400],
 'site': ['site1', 'site2', 'site3', 'site4', nan],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [1, 2, 3, 4, 'a']}

Feitas tais considerações, podemos fazer o nosso primeiro __DataFrame__

In [19]:
pd.DataFrame?

In [20]:
dataframe = pd.DataFrame(dados)

In [21]:
dataframe

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2
2   instagram      300  site3  2002.00     3
3    linkedin      400  site4  5000.00     4
4    facebook      400    NaN   300.00     a

Quando um df é muito grande, ele não é impresso na integra, somente os valores iniciais e finais são mostrados. Mas é possível acessá-los separadamente com os comandos
```python
df.head(número_de_linhas)
df.tail(número_de_linhas)
```

In [22]:
dataframe.head(2)

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2

In [23]:
dataframe.tail(1)

  canal_venda  acessos site  vendas lista
4    facebook      400  NaN   300.0     a

Como maneira prática, podemos ver a "cara" do conjunto de dados usando o comando (@property)
```python
df.shape
```
ele retorna uma tupla que diz quantidade de linhas e colunas do df, sendo (linha, coluna)

In [24]:
dataframe.shape

(5, 5)

Podemos ver também os Indices do df usando o método
```python
df.index
```

In [25]:
dataframe.index

RangeIndex(start=0, stop=5, step=1)

É possível ver também quais tipos primitivos os dados do df possuem
```python
df.dtypes
```

In [26]:
dataframe.dtypes  # porém não é tão confiável, pois na coluna "lista" 4 valores são int64 e 1 é object

canal_venda     object
acessos          int64
site            object
vendas         float64
lista           object
dtype: object

Podemos ver mais a fundo as características do df com o método
```python
df.info()
```

In [27]:
pd.DataFrame.info?

In [28]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         4 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

É possível também fazer um resumo das informações do seu df com o comando
```python
df.describe()
```

In [29]:
dataframe.describe()

          acessos       vendas
count    5.000000     5.000000
mean   280.000000  1870.972000
std    130.384048  1850.931024
min    100.000000   300.000000
25%    200.000000  1000.520000
50%    300.000000  1052.340000
75%    400.000000  2002.000000
max    400.000000  5000.000000

Quando temos valores iguais numa coluna, não precisamos fazer um _for_ e implementar um contador para descobrir quantas vezes um mesmo valor aparece, basta usar o método
```python
Series.value_counts(normalize=True ou False, bins=int)
```
**Parâmetros:**
* normalize = retorna a **frequência relativa** de cada valor
* bins = retorna faz *int* **intervalos de classes**

In [118]:
pd.Series.value_counts?

In [30]:
dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
linkedin     1
instagram    1
Name: canal_venda, dtype: int64

In [113]:
dataframe['canal_venda'].value_counts(normalize=True)

facebook     0.4
twitter      0.2
linkedin     0.2
instagram    0.2
Name: canal_venda, dtype: float64

In [115]:
dataframe['vendas'].value_counts(bins=3)

(295.29900000000004, 1866.667]    3
(3433.333, 5000.0]                1
(1866.667, 3433.333]              1
Name: sellings, dtype: int64

In [117]:
dataframe['vendas'].value_counts(normalize=True, bins=3)

(295.29900000000004, 1866.667]    0.6
(3433.333, 5000.0]                0.2
(1866.667, 3433.333]              0.2
Name: sellings, dtype: float64

Em colunas numéricas, podemos fugir das iterações para certas operações simples com os métodos
* Series.count() retorna o __Número__ de valores da coluna
* Series.sum(axis=0 ou 1) retorna a __Soma__ dos valores do eixo
* Series.max(axis=0 ou 1) retorna o valor __Máximo__ do eixo
* Series.min(axis=0 ou 1) retorna o valor __Mínimo__ do eixo
* Series.mean(axis=0 ou 1) retorna a __Média__ do eixo
* Series.median(axis=0 ou 1) retorna a __Mediana__ do eixo
* Series.mode() retorna a __Moda__
* Series.std(axis=0 ou 1) retorna o __Desvio Padrão__

In [31]:
dataframe['acessos'].sum()

1400

In [32]:
dataframe['acessos'].mode()  # embora mostre dois valores, o primeiro é um índice apenas

0    400
dtype: int64

Uma coisa que nos depararemos __MUITO__ é nos dados faltantes, sejam eles _Nan_ ou _Nulls_. E para lidar com esse tipo de dado, usamos os métodos
* df.isna() retorna um valor booleano __True__ na posição do valor *NaN*, e **False** na posição que não é 
* df.isnull() retorna um valor booleano na  __True__ na posição do valor *Null*,e **False** na posição que nã é

In [33]:
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False   True   False  False

In [34]:
dataframe.isnull()  # embora não pareça, eles tem diferença

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False   True   False  False

Podemos unir dois métodos que já vimos para visualizar melhor a quantidade de *Nan* ou *Null* que podem existir num df, já que df muito grandes não se imprime todos os seus valores na tela. Podemos escolher uma coluna e
```python
Series.isna().value_counts()
```

In [35]:
dataframe['site'].isna()

0    False
1    False
2    False
3    False
4     True
Name: site, dtype: bool

In [36]:
dataframe['site'].isna().value_counts()

False    4
True     1
Name: site, dtype: int64

É possível adicionar novas colunas no df assim como um dicionário
```python
df['título'] = [lista de valores]
```

Da mesma forma que é possivel acessar valores tal qual um dicionário, embora existam maneiras muito mais eficientes
```python
df['Título'][formas de slicing]
```

In [37]:
dataframe['acessos'][:3]

0    100
1    200
2    300
Name: acessos, dtype: int64

In [38]:
dataframe['lista_2'] = [4, 5, 6, 7, 9]
dataframe

  canal_venda  acessos   site   vendas lista  lista_2
0    facebook      100  site1  1000.52     1        4
1     twitter      200  site2  1052.34     2        5
2   instagram      300  site3  2002.00     3        6
3    linkedin      400  site4  5000.00     4        7
4    facebook      400    NaN   300.00     a        9

Podemos consultar as colunas do df também
```python
df.columns
```

In [39]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'lista_2'], dtype='object')

Caso o df tenha muitas colunas, talvez nao revele todas elas dessa maneira, mas dessa revela
```python
df.columns.values
```

In [40]:
dataframe.columns.values

array(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'lista_2'],
      dtype=object)

Podemos modificar os títulos das colunas de um df de algumas maneiras, mas como os df geralmente são muito grandes e com muitas colunas, o melhor jeito é com o método
```python
df.rename(columns={'Título Atual': 'Título Novo', ...}, inplace=True ou False)
```
Lembrando que o parâmetro Inplace modifica o df em todas as suas requisições caso seu valor seja *True*

In [41]:
pd.DataFrame.rename?

In [42]:
dataframe.rename(columns={'canal_venda': 'plataforma_venda', 'acessos':'visualizações'})

  plataforma_venda  visualizações   site   vendas lista  lista_2
0         facebook            100  site1  1000.52     1        4
1          twitter            200  site2  1052.34     2        5
2        instagram            300  site3  2002.00     3        6
3         linkedin            400  site4  5000.00     4        7
4         facebook            400    NaN   300.00     a        9

Outra forma bem simples para mudar o título de um coluna
```python
Series.name = 'Título'
```

In [43]:
variavel = dataframe['vendas']
variavel.name = 'sellings'
variavel  # será útil quando entrarmos em join

0    1000.52
1    1052.34
2    2002.00
3    5000.00
4     300.00
Name: sellings, dtype: float64

Outro método que serve pra tudo que é _string_ é o
```python
str.replace('caracter ou string antiga', 'caracter ou string nova')
str.replace({'string antiga': 'string nova', 'string antiga': 'string nova', ...})
```

In [44]:
pd.Series.str.replace?

In [45]:
dataframe.columns.str.replace('_', ' ')  # dataframe.columns = dataframe.columns.str.replace('_', ' ')

Index(['canal venda', 'acessos', 'site', 'vendas', 'lista', 'lista 2'], dtype='object')

In [46]:
a = dataframe.copy()

In [47]:
a.columns = a.columns.str.replace('_', ' ')
a

  canal venda  acessos   site   vendas lista  lista 2
0    facebook      100  site1  1000.52     1        4
1     twitter      200  site2  1052.34     2        5
2   instagram      300  site3  2002.00     3        6
3    linkedin      400  site4  5000.00     4        7
4    facebook      400    NaN   300.00     a        9

Para __EXCLUIR__ colunas de um df
```python
df.drop(columns=['Título', 'Título', ...], inplace=True ou False)
df.drop(columns='Título', inplace=True ou False)
```

In [48]:
dataframe.drop(columns='lista_2')

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2
2   instagram      300  site3  2002.00     3
3    linkedin      400  site4  5000.00     4
4    facebook      400    NaN   300.00     a

In [49]:
dataframe.drop(columns=['lista', 'lista_2'])

  canal_venda  acessos   site   vendas
0    facebook      100  site1  1000.52
1     twitter      200  site2  1052.34
2   instagram      300  site3  2002.00
3    linkedin      400  site4  5000.00
4    facebook      400    NaN   300.00

**Nunca coloque um código de um cientista de dados em produção kkkkkk**

Vimos que fazer **slicing** de *Series* é bem tranquilo, funciona igual listas. Mas, e para um *DataFrame* inteiro? Acredito que saber isso é tão relevante quanto o primeiro caso. Para tanto, temos os métodos
* .loc[] aceita índices numéricos e strings para linhas, e strings para colunas
* .iloc[] aceita apenas índices numéricos tanto para linhas quanto colunas
e a sintaxe deles funciona de maneira muito similar
```python
df.loc[]
df.iloc[]
```
O que vai dentro das chaves também não muda muito
* .iloc[]
    * [indice_linha]
    
    * [indice_linha, indice_coluna]
    
    * [[indice_linha, indice_linha], indice_coluna]
    
    * [[indice_linha, indice_linha], [indice_coluna, indice_coluna]]
    
    * [indice_linha, [indice_coluna, indice_coluna]]
    
    * [indice_linha_i:indice_linha_f, indice_coluna]
    
    * [indice_linha, indice_coluna_i:indice_coluna_f]
    
    * [indice_linha_i:indice_linha_f, indice_coluna_i:indice_coluna_f]


* .loc[]
    
    * [indice_linha]
    
    * [indice_linha, 'titulo_coluna']
    
    * [[indice_linha, indice_linha], 'titulo_coluna']
    
    * [[indice_linha, indice_linha], ['titulo_coluna', 'titulo_coluna']]
    
    * [indice_linha, ['titulo_coluna', 'titulo_coluna']]
    
    * [indice_linha_i:indice_linha_f, 'titulo_coluna']
    
    * [indice_linha, 'titulo_coluna_i':'titulo_coluna_f']
    
    * [indice_linha_i:indice_linha_f, 'titulo_coluna_i':'titulo_coluna_f']

**Lembre**: o *indice_linha* do **.loc[]** pode ser tanto **número** quanto **string**

**Lembre 2**: Não esqueça que índices tipo *String* podem **MUDAR**, ou serem **EXCLUIDOS**. Ter algo em produção que use índices numéricos, pode ser mais vantajoso

In [50]:
dataframe.iloc[0]

canal_venda    facebook
acessos             100
site              site1
vendas          1000.52
lista                 1
lista_2               4
Name: 0, dtype: object

In [51]:
dataframe.iloc[:, 0]

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [52]:
dataframe.loc[[0, 3], 'vendas']

0    1000.52
3    5000.00
Name: sellings, dtype: float64

In [53]:
dataframe.loc[:3, ['vendas', 'acessos']]

    vendas  acessos
0  1000.52      100
1  1052.34      200
2  2002.00      300
3  5000.00      400

In [54]:
dataframe.loc[[0,3], 'acessos':'vendas']

   acessos   site   vendas
0      100  site1  1000.52
3      400  site4  5000.00

Tal qual o Excel, é possível fazer **Tabelas Dinâmicas** com pandas, não tão dinamica assim mas a idéia é boa
```python
df.pivot(index='Título', columns='Título', values=['Título 1', 'Título 2'])
```
**Parâmetros:**
* index = coluna que será usada pra fazer os índices da tabela com os seus valores
* columns = coluna que será usada pra fazer as colunas da tabela com os seus valores
* values = coluna que preencherá a tabela com seus valores, seguindo o pedido pelos índices e colunas

In [56]:
dataframe.pivot(index='canal_venda', columns='site', values='acessos')

site           NaN  site1  site2  site3  site4
canal_venda
facebook     400.0  100.0    NaN    NaN    NaN
instagram      NaN    NaN    NaN  300.0    NaN
linkedin       NaN    NaN    NaN    NaN  400.0
twitter        NaN    NaN  200.0    NaN    NaN

In [59]:
pd.pivot?

In [63]:
pd.melt?

Podemos **alterar** os índices de um df ou Series, e também resetar
```python
df.set_index('Título', inplace=True ou False)
df.reset_index(inplace=True ou False)
```
**Lembre:** para fazer isso, tem que ser um *Título* de valore **únicos**

In [71]:
dataframe.set_index('site')

      canal_venda  acessos   vendas lista  lista_2
site
site1    facebook      100  1000.52     1        4
site2     twitter      200  1052.34     2        5
site3   instagram      300  2002.00     3        6
site4    linkedin      400  5000.00     4        7
NaN      facebook      400   300.00     a        9

E para voltar os índices ao normal basta dar um reset
```python
df.reset_index(inplace=True ou False)
```

In [77]:
site_index = dataframe.set_index('site')
site_index

      canal_venda  acessos   vendas lista  lista_2
site
site1    facebook      100  1000.52     1        4
site2     twitter      200  1052.34     2        5
site3   instagram      300  2002.00     3        6
site4    linkedin      400  5000.00     4        7
NaN      facebook      400   300.00     a        9

In [79]:
site_index.reset_index()

    site canal_venda  acessos   vendas lista  lista_2
0  site1    facebook      100  1000.52     1        4
1  site2     twitter      200  1052.34     2        5
2  site3   instagram      300  2002.00     3        6
3  site4    linkedin      400  5000.00     4        7
4    NaN    facebook      400   300.00     a        9

Como vimos, sempre teremos *df* ou *Series* com dados faltantes, os famosos **NaN**. E para fazer aplicações de ML, devemos tratá-los, preenchendo com um valor conveniente o seu lugar. Para tanto
```python
df.fillna(value, inplace=True ou False, axis=0 ou 1)
df.dropna(subset=['Título', 'Título'], thrash=int, how='any' ou 'all', axis=0 ou 1, inplace=True ou False)
```
**Parâmetros**
* how = se tiver 1 valor NaN na linha:'any', se todos NaN:'all'
* thresh = manter o eixo com apenas *int* não NaN
* subset = colunas que o *.dropna()* vai olhar se tem NaN

In [92]:
pd.DataFrame.dropna?

Novamente, para descobrimos quais valores únicos, e o número de valores únicos num *df* ou *Series*, nao iterarmos no conjunto de dados, podemos usar
```python
Series.unique()
Series.nunique()
df.nunique()
```

In [102]:
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [105]:
dataframe['canal_venda'].nunique()

4

In [107]:
dataframe.nunique()

canal_venda    4
acessos        4
site           4
vendas         5
lista          5
lista_2        5
dtype: int64

**Este espaço será destinado ao GROUBY**

Uma das coisas que nos deparamos na estatístca é o **Coeficiente de Correlação**, que nos dá um valor de -1 a 1 de quão bem uma variável explica a outra. E para termos essa medida
```python
df.corr(method='pearson', 'kendall', 'spearman')
```

In [123]:
pd.DataFrame.corr?

In [128]:
dataframe.corr()

          acessos    vendas   lista_2
acessos  1.000000  0.426549  0.917070
vendas   0.426549  1.000000  0.068508
lista_2  0.917070  0.068508  1.000000

Vimos que podemos fazer **intervalos de classes** com o método *.count_values()*, mas tem como fazer com um método próprio pra isso. Ele retorna uma *Series* que encaixa cada índice no respectivo **intervalo de classe**
```python
pd.cut(x = Series, bins=(limites dos intervalos), labels=('0 - 100', '100 - 200', ...))
```

In [131]:
pd.cut?

In [135]:
pd.cut(x=dataframe['vendas'], bins=(0, 1500, 3000, 4500, 6000), labels=('0 - 1500', '1500 - 3000', '3000 - 4500', '4500 - 6000'))

0       0 - 1500
1       0 - 1500
2    1500 - 3000
3    4500 - 6000
4       0 - 1500
Name: sellings, dtype: category
Categories (4, object): [0 - 1500 < 1500 - 3000 < 3000 - 4500 < 4500 - 6000]

In [136]:
a = pd.cut(x=dataframe['vendas'], bins=(0, 1500, 3000, 4500, 6000), labels=('0 - 1500', '1500 - 3000', '3000 - 4500', '4500 - 6000'))
dataframe['Intervalo de Classes'] = a
dataframe

  canal_venda  acessos   site   vendas lista  lista_2 Intervalo de Classes
0    facebook      100  site1  1000.52     1        4             0 - 1500
1     twitter      200  site2  1052.34     2        5             0 - 1500
2   instagram      300  site3  2002.00     3        6          1500 - 3000
3    linkedin      400  site4  5000.00     4        7          4500 - 6000
4    facebook      400    NaN   300.00     a        9             0 - 1500